### Import the necessary libraries

In [19]:
import pandas as pd
import sqlalchemy as alch

### Store your username and password for the database
You can choose to do this with getpass or with an environment variable.

In [20]:
from getpass import getpass
password = getpass("Introduce tu pass de sql: ")

Introduce tu pass de sql: ········

### Establishes the connection to the database

In [21]:
dbName="publications"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"

### Remember to create the engine

In [22]:
engine = alch.create_engine(connectionData)
print("Connected to server!")

Connected to server!

## Challenge 1 - Who Have Published What At Where?
In this challenge you will write a MySQL `SELECT` query that joins various tables to figure out what titles each author has published at which publishers. Your output should have at least the following columns:

* `AUTHOR ID` - the ID of the author
* `LAST NAME` - author last name
* `FIRST NAME` - author first name
* `TITLE` - name of the published title
* `PUBLISHER` - name of the publisher where the title was published

In [23]:
df = pd.read_sql_query(
"""
SELECT authors.au_id AS AUTHOR_ID , authors.au_lname AS LAST_NAME, authors.au_fname AS FIRST_NAME, titles.title AS TITLE, publishers.pub_name AS PUBLISHER
FROM authors
    INNER JOIN titleauthor
        ON titleauthor.au_id = authors.au_id
    INNER JOIN titles
        ON titles.title_id = titleauthor.title_id
    INNER JOIN publishers
        ON publishers.pub_id = titles.pub_id;
        
""", engine
)

In [24]:
df.head()

,AUTHOR_ID,LAST_NAME,FIRST_NAME,TITLE,PUBLISHER
0,213-46-8915,Green,Marjorie,The Busy Executive's Database Guide,Algodata Infosystems
1,409-56-7008,Bennet,Abraham,The Busy Executive's Database Guide,Algodata Infosystems
2,267-41-2394,O'Leary,Michael,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
3,724-80-9391,MacFeather,Stearns,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
4,213-46-8915,Green,Marjorie,You Can Combat Computer Stress!,New Moon Books

## Challenge 2 - Who Have Published How Many At Where?
More info in the readme.md

In [25]:
df = pd.read_sql_query(
"""
SELECT authors.au_id AS AUTHOR_ID, authors.au_lname AS LAST_NAME, authors.au_fname AS FIRST_NAME, publishers.pub_name AS PUBLISHER, COUNT(titles.title) AS COUNT_TITLES
FROM authors
INNER JOIN titleauthor
ON titleauthor.au_id = authors.au_id
INNER JOIN titles
ON titles.title_id = titleauthor.title_id
INNER JOIN publishers
ON publishers.pub_id = titles.pub_id
GROUP BY authors.au_id,publishers.pub_name ;
        
""", engine
)

In [26]:
df.head()

     AUTHOR_ID   LAST_NAME FIRST_NAME             PUBLISHER  COUNT_TITLES
0  213-46-8915       Green   Marjorie  Algodata Infosystems             1
1  409-56-7008      Bennet    Abraham  Algodata Infosystems             1
2  267-41-2394     O'Leary    Michael  Algodata Infosystems             1
3  724-80-9391  MacFeather    Stearns  Algodata Infosystems             1
4  213-46-8915       Green   Marjorie        New Moon Books             1

## Challenge 3 - Best Selling Authors
More info in the readme.md

In [27]:
df = pd.read_sql_query(
"""
SELECT authors.au_id AS AUTHOR_ID, authors.au_lname AS LAST_NAME, authors.au_fname AS FIRST_NAME, SUM(sales.qty) AS TOTAL
FROM authors
INNER JOIN titleauthor
ON titleauthor.au_id = authors.au_id
INNER JOIN titles
ON titles.title_id = titleauthor.title_id
INNER JOIN sales
ON sales.title_id = titles.title_id 
GROUP BY publications.authors.au_id
ORDER BY TOTAL DESC
LIMIT 3;

        
""", engine
)

In [28]:
df

     AUTHOR_ID LAST_NAME FIRST_NAME  TOTAL
0  899-46-2035    Ringer       Anne  148.0
1  998-72-3567    Ringer     Albert  133.0
2  213-46-8915     Green   Marjorie   50.0

## Challenge 4 - Best Selling Authors Ranking
More info in the readme.md

In [29]:
df = pd.read_sql_query(
"""
SELECT authors.au_id AS AUTHOR_ID, authors.au_lname AS LAST_NAME, authors.au_fname AS FIRST_NAME, SUM(ifnull(sales.qty,0)) AS TOTAL
FROM authors
LEFT JOIN titleauthor
ON titleauthor.au_id = authors.au_id
LEFT JOIN titles
ON titles.title_id = titleauthor.title_id
LEFT JOIN sales
ON sales.title_id = titles.title_id 
GROUP BY authors.au_id
ORDER BY TOTAL DESC
LIMIT 23;

        
""", engine
)

In [30]:
df

      AUTHOR_ID       LAST_NAME   FIRST_NAME  TOTAL
0   899-46-2035          Ringer         Anne  148.0
1   998-72-3567          Ringer       Albert  133.0
2   213-46-8915           Green     Marjorie   50.0
3   427-17-2319            Dull          Ann   50.0
4   846-92-7186          Hunter       Sheryl   50.0
5   267-41-2394         O'Leary      Michael   45.0
6   724-80-9391      MacFeather      Stearns   45.0
7   722-51-5454        DeFrance       Michel   40.0
8   807-91-6654        Panteley       Sylvia   40.0
9   238-95-7766          Carson       Cheryl   30.0
10  486-29-1786        Locksley     Charlene   25.0
11  472-27-2349      Gringlesby         Burt   20.0
12  648-92-1872  Blotchet-Halls     Reginald   20.0
13  672-71-3249        Yokomoto        Akiko   20.0
14  756-30-7391          Karsen        Livia   20.0
15  172-32-1176           White      Johnson   15.0
16  274-80-9391        Straight         Dean   15.0
17  409-56-7008          Bennet      Abraham   15.0
18  712-45-1867    del Castillo        Innes   10.0
19  341-22-1782           Smith      Meander    0.0
20  527-72-3246          Greene  Morningstar    0.0
21  724-08-9931        Stringer         Dirk    0.0
22  893-72-1158        McBadden      Heather    0.0

## Bonus Challenge - Most Profiting Authors

In [33]:
df = pd.read_sql_query(
"""
SELECT authors.au_id AS AUTHOR_ID, authors.au_lname AS LAST_NAME, authors.au_fname AS FIRST_NAME, SUM((titles.advance / titleauthor.royaltyper) + ((titles.royalty*sales.qty) / titleauthor.royaltyper)) AS PROFIT
FROM authors
INNER JOIN titleauthor
ON titleauthor.au_id = authors.au_id
INNER JOIN titles
ON titles.title_id = titleauthor.title_id 
INNER JOIN sales
ON sales.title_id = titles.title_id 
GROUP BY publications.authors.au_id
ORDER BY PROFIT DESC
LIMIT 3;

""", engine
)

In [34]:
df

     AUTHOR_ID LAST_NAME FIRST_NAME       PROFIT
0  899-46-2035    Ringer       Anne  1446.320000
1  722-51-5454  DeFrance     Michel   412.800000
2  267-41-2394   O'Leary    Michael   404.583333